app/controllers/articles_controller.rb

	def create
		#if you just want to look at a printout of the results of the form:
		#render plain: params[:article].inspect
		@article = Article.new(article_params)

		@article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-06-17 17:46:46.244739"], ["text", "Anya test first time"], ["title", "Test"], ["updated_at", "2014-06-17 17:46:46.244739"]]